test_cases/mesh_dependency_study/mesh_o3_i3/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         2000;

deltaT          0.01;

writeControl    adjustableRunTime;

writeInterval   1.0;

purgeWrite      1;

writeFormat     binary;

writePrecision  8;

timeFormat      general;

timePrecision   8;

adjustTimeStep yes;

maxDeltaT 0.01;

maxCo 1.0;

runTimeModifiable true;

functions
{
    forces
    {
        type            forceCoeffs;
        libs            (forces);
        writeControl    writeTime;
        log false;
        writeFields     yes;

        patches
        (
            cylinders
        );

        rhoInf      1;
        rho         rhoInf;

        CofR        (-0.433 0.0 0.0);
        liftDir     (0 1 0);
        dragDir     (1 0 0);
        //pitchAxis   (0 0 1);
        magUInf     1.0;
        lRef        2.5;
        Aref        0.05;
    }
    
    
    field_cylinder_a
    {

        type            surfaceFieldValue;
        libs            (fieldFunctionObjects);
        fields          (forces:forceCoeff);
        operation       sum;
        regionType      faceZone;
        name            faceZone_a;
        weightField     none;
        writeFields     no;
        surfaceFormat   raw;

    }

    field_cylinder_b
    {

        type            surfaceFieldValue;
        libs            (fieldFunctionObjects);
        fields          (forces:forceCoeff);
        operation       sum;
        regionType      faceZone;
        name            faceZone_b;
        weightField     none;
        writeFields     no;
        surfaceFormat   raw;

    }
    field_cylinder_c
    {

        type            surfaceFieldValue;
        libs            (fieldFunctionObjects);
        fields          (forces:forceCoeff);
        operation       sum;
        regionType      faceZone;
        name            faceZone_c;
        weightField     none;
        writeFields     no;
        surfaceFormat   raw;

    }


}

// ************************************************************************* //
